[
	{
		"Image":"images/interviews/tomas.jpg",
		"Title":"University of Oxford",
		"Name":"Tomáš Halgaš",
		"ShortInfo":"Graduated in 2010/2011<br>Forbes 30 Under 30 issued by Forbes Slovakia in April 2022, Master of Mathematics and Computer Science at the University of Oxford",
		"LongInfo":"Tomáš sa narodil v Bratislave. Absolvoval bilingválne gymnázium Galileo School. V roku 2011 odišiel do Veľkej Británie študovať na University of Oxford, kde získal bakalársky a neskôr magisterský titul v odboroch matematika a informatika (Computer Science).\r\n Po ukončení štúdia pracoval krátky čas ako inžinier v spoločnosti Facebook. V tom čase začal s Nickom D'Aloisiom, s ktorým sa spoznal počas štúdia na Oxforde, diskutovať o riešení, z ktorého neskôr vznikol projekt Sphere. Koncom roka 2015 spolu založili spoločnosť Sphere Knowledge Limited s Nickom D'Aloisiom ako CEO a Tomášom Halgašom ako CTO. Projekt s tímom 30+ ľudí financovali slávni investori ako Index Ventures, Horizons Ventures, Mike Moritz (jeden z prvých investorov do Google), Brian Chesky (zakladateľ Airbnb) a Sean Rad (zakladateľ Tinderu).\r\nProjekt Sphere odkúpila v roku 2021 jedna z najväčších sociálnych sietí na svete, spoločnosť Twitter.",
		"PhotosFolderPath":null
	},
	{
		"Image":"images/interviews/jakub_rybansky_rgb.jpg",
		"Title":"University College London",
		"Name":"Jakub Ribanský",
		"ShortInfo":"Graduated in 2015/2016<br>Specialized in Spanish and Russian language at University College London, UK",
		"LongInfo":"Ako GALILEO SCHOOL zmenilo môj život: GALILEO SCHOOL mi pripravilo výborné jazykové zázemie pre štúdium v zahraničí a taktiež pripravilo na výzvy univerzitného života.\r\nAko ma štúdium na GALILEO SCHOOL pripravilo na univerzitu: Vďaka štúdiu na GALILEO SCHOOL som získal výborný rozhľad pred vstupom do univerzitného života, a vďaka výbornému feedbacku v škole som vedel čo ma čaká, napríklad pri písaní akademických prác.",
		"PhotosFolderPath":null
	},
	{
		"Image":"images/interviews/Luki_rgb.jpg",
		"Title":"University of Oxford",
		"Name":"Lukáš Halgaš",
		"ShortInfo":"Graduated in 2014<br>Studied Mathematics and Computer Science (Masters), Computer Science - Security (DPhil) at St Anne’s College (Masters), Linacre College (DPhil), University of Oxford, UK",
		"LongInfo":"How has GALILEO SCHOOL changed my life? How did GALILEO SCHOOL prepare me for college? During my first lecture on Mathematical Analysis, Professor Priestley famously presented the imagery of her course equipping my peers and me with tools to build our Skyscraper of Mathematics. By the end of the first lecture on the Axioms of Algebra, our tools equated to a stone and a nail. After eight weeks of Analysis, Professor Priestley, resembling a Perwool commercial, drew a hammer and a chisel from her purse to introduce us to our prevailing tools. Building the Skyscraper of Mathematics is hard work I would have long given up on, was my perseverance not nurtured throughout GALILEO SCHOOL by the gradual workload exquisitely composed by my favourite team of teachers. During classes and tutorials with Mr Bezak, we constructed the base for higher floors so well engineered, that Rainier Tower could outgrow Burj Khalifa on top of it.\r\nIt was at GALILEO SCHOOL that I discovered the big project I set to develop and acquired the ability to carry on despite the possible unattainability of its completion.\r\nWithout GALILEO SCHOOL, I might not have had the skills for the real world, but I was directed straight to obtain them, with optimism.\r\nI am most thankful for the emphasis of GALILEO SCHOOL on developing communication skills. To all the prospective mathematicians-invariants: the presentations, countless essays and ‘journal entries’ do matter. Success requires resilience and hard work. Focus on the them, the environment of GALILEO SCHOOL is excellent for their development and recognition.",
		"PhotosFolderPath":null
	},
	{
		"Image":"images/interviews/orth_rgb.jpg",
		"Title":"Santa Clara University",
		"Name":"Filip Orth",
		"ShortInfo":"Graduated in 2016/2017<br>Studied Business and Entrepreneur Major at Santa Clara University, California, U.S.A.",
		"LongInfo":"Ako GALILEO SCHOOL zmenilo tvoj život? GALILEO SCHOOL has changed my life in motivating me to gain the best version of myself as well as creating an environment which drove my educational ambitions. Galileo was one of the external forces which influenced me in stepping out of my comfort zone and being able to present myself as an individual.\r\nAko štúdium na GALILEO SCHOOL pripravilo na univerzitu? I feel GALILEO SCHOOL has prepared me for university by creating and enforcing the solid pillars of my foundations in education to succeed further as I enter university. This school also taught me a lot of principles and values, that now I am able to apply at university as well as in my life.\r\nOdkaz terajším a budúcim študentom GALILEO SCHOOL? Simply engage yourself, explore, be active, and be creative. Drive your intellectual curiosity! Filip Orth",
		"PhotosFolderPath":null
	},
	{
		"Image":"images/interviews/martinakova.jpg",
		"Title":"Quinnipiac University",
		"Name":"Alexandra Martináková",
		"ShortInfo":"Graduated in 2021/2022<br>Literature and Journalism majors and a Psychology minor at Quinnipiac University in Connecticut, U.S.A.",
		"LongInfo":"Career paths can be a tough part of life. People of all ages dwell on it for a while. Whether it be the dream to be an astronaut as a child, or to get employed at a prestigious firm. Is there a point in your life when you discover what you want to be in the future? We asked this question to our former student Alexandra Martináková, a successful journalist with a Literature and Journalism majors and a Psychology minor. “I had no idea what I wanted to do for such a long time. Sometimes, I still don't know. And I kind of like it that way.” She describes her unpredictable career trajectory with a sense of adventure. Alexandra studies at Quinnipiac University in Connecticut, which is quite the distance. She has quite the story to tell how she got there: “It's kind of a funny story as to how I found this university. I remember sitting in a class, at one of our Gym 5 seminars, next to a girl from another class. She was looking at universities in the US as well, and I remember looking over and seeing the name 'Quinnipiac' and thinking it was so funny to name a university like that. So, I looked more into it and realised the university had the program I was looking for and it was in a great location! So, I applied and was fortunate enough to get a scholarship. Now, here I am!” Galileo School Gymnasium helped her gain many new field experiences. Alexandra dreaded speaking in front of crowds and making presentations but “doing it now is extremely easy thanks to it.” But changing your life to a different course can be challenging and often, people are presented with multiple setbacks. Because Alexandra visited the US before, she had an idea of what she was getting into, but moving there overnight was not easy. “Even now, a year and a half later, I still experience culture shocks,” she said. It can be hard, but definitely exciting. There is a sense of independence when an individual reaches adulthood and travels the world. Going to campus is not hard for Alexandra, as she lives two minutes away and works on campus, which is a favorable advantage. A key aspect of career choices is inspiration. What was Alexandra inspired by? She got to fulfill her childhood dream as she always loved to write. She was originally attending college to get an English major, but an opportunity to write for the Quinnipiac Chronicle popped up. She took the opportunity and instantly fell in love with writing again. She turned her life around and changed her program to a double Journalism major in that first semester! Alexandra Martinákova enjoys what she does with passion and follows paths which feel right to her. “Reporting connects you with so many people and you get the opportunity to tell their stories, and truly, as cheesy as it sounds, it's really rewarding to me,” she said",
		"PhotosFolderPath":null
	},
	{
		"Image":"images/interviews/samo_rybansky_rgb.jpg",
		"Title":"The University of Sheffield",
		"Name":"Samuel Ribanský",
		"ShortInfo":"Graduated in 2013/2014<br>Studied Politics and Philosophy at The University of Sheffield, UK",
		"LongInfo":"Ako GALILEO SCHOOL zmenilo tvoj život:Galileo School mi ukázalo, že akýmkoľvek smerom sa vyberiem, vždy sa dá uspiet - avšak tento úspech nikdy nepríde sám a musí byť sprevádzaný neustálym úsilím a prácou. A že nad nikým netreba lámat palicu!\r\nAko štúdium na GALILEO SCHOOL pripravilo na univerzitu: Dvojako: Najprv, GS ponúka užasnú možnosť svojim študentom sa zúčastniť na výletoch na rôzne univerzity, ako aj čerpat informácie zo svojej siete absolventov - GS mi teda vedelo odporučiť tú správnu Univerzity a zároveń mi povedať, čo od nej môžem očakávať. Po druhé, učitelia na GS oboznámení s medzinárodnými akademickými štandardmi mi pomohli pripraviť sa na akademický prístup k vzdelaniu špecificky krajine v ktorej som sa rozhodol študovať\r\nOdkaz terajším a budúcim študentom GALILEO SCHOOL: Veľa čítajte. Čítajte všetko čo vám príde pod ruku, lebo len tak si dokážete utvoriť rozumný obraz o svete a zistiť kde je vaše miesto. A cieľavedomo pracujte na dosiahnutí čohokoľvek čo si zaumienite - v zahraničí sa ‘čo viete’ cení oveľa viac ako ‘koho poznáte’.",
		"PhotosFolderPath":null
	}
]